Public Member Functions | Public Attributes | List of all members
API_ExtendedPenType Struct Reference
Element Manager API
Describes the optionally overridden pen used for hatches. More...
#include <APIdefs_Elements.h>
 Public Member Functions
void  | Set (short pen1, short pen2)
bool  | IsOverriden () const
short  | GetEffectiveColorIndex () const
 Public Attributes
short  | penIndex
The pen color index if not overridden; the original pen index.
short  | colorOverridePenIndex
The pen color index if overridden.
Detailed Description
Describes the optionally overridden pen used for hatches.
Remarks
This struct contains a few helper functions:
 Function  | Goal
 void Set (short pen1, short pen2)  | Sets both the normal and the overridden pen color index.
 bool IsOverriden () const  | Tells whether the pen index is overridden.
 short GetEffectiveColorIndex () const  | Returns the effective pen color index.
Member Function Documentation
◆ GetEffectiveColorIndex()
 short API_ExtendedPenType::GetEffectiveColorIndex  |  ( |   | ) |   const
inline
◆ IsOverriden()
 bool API_ExtendedPenType::IsOverriden  |  ( |   | ) |   const
inline
◆ Set()
 void API_ExtendedPenType::Set  |  ( |  short  |  pen1,
|  short  |  pen2
)
inline
Member Data Documentation
◆ colorOverridePenIndex
 API_ExtendedPenType::colorOverridePenIndex
The pen color index if overridden.
◆ penIndex
 API_ExtendedPenType::penIndex
The pen color index if not overridden; the original pen index.